demo_client/soap_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:calc="http://www.testing-software.org/calc">
   <soapenv:Header/>
   <soapenv:Body>
      <calc:addRequest>
         <calc:a>10</calc:a>
         <calc:b>20</calc:b>
      </calc:addRequest>
   </soapenv:Body>
</soapenv:Envelope>